__module__ = "𝖬𝗎𝗌𝗂𝖼"

__help__ = """𝖳𝗁𝗂𝗌 𝗆𝗈𝖽𝗎𝗅𝖾 𝗉𝗋𝗈𝗏𝗂𝖽𝖾𝗌 𝖺 𝗏𝗂𝗌𝗎𝖺𝗅 𝗆𝗎𝗌𝗂𝖼 𝗌𝗍𝗋𝖾𝖺𝗆𝗂𝗇𝗀 𝗌𝗒𝗌𝗍𝖾𝗆 𝖿𝗈𝗋 𝗏𝗈𝗂𝖼𝖾 𝖼𝗁𝖺𝗍𝗌.

**𝖴𝗌𝖾𝗋 𝖢𝗈𝗆𝗆𝖺𝗇𝖽𝗌:**
𝟣. /𝗉𝗅𝖺𝗒 <𝗌𝗈𝗇𝗀_𝗇𝖺𝗆𝖾> - 𝖲𝗍𝖺𝗋𝗍𝗌 𝗌𝗍𝗋𝖾𝖺𝗆𝗂𝗇𝗀 𝗍𝗁𝖾 𝗋𝖾𝗊𝗎𝖾𝗌𝗍𝖾𝖽 𝗍𝗋𝖺𝖼𝗄.
𝟤. /𝗏𝗉𝗅𝖺𝗒 <𝗏𝗂𝖽𝖾𝗈_𝗇𝖺𝗆𝖾> - 𝖲𝗍𝖺𝗋𝗍𝗌 𝗌𝗍𝗋𝖾𝖺𝗆𝗂𝗇𝗀 𝗍𝗁𝖾 𝗋𝖾𝗊𝗎𝖾𝗌𝗍𝖾𝖽 𝗏𝗂𝖽𝖾𝗈.
𝟥. /𝖿𝗈𝗋𝖼𝖾𝗉𝗅𝖺𝗒 <𝗌𝗈𝗇𝗀_𝗇𝖺𝗆𝖾> - 𝖲𝗍𝗈𝗉𝗌 𝗍𝗁𝖾 𝖼𝗎𝗋𝗋𝖾𝗇𝗍 𝗍𝗋𝖺𝖼𝗄 𝖺𝗇𝖽 𝗌𝗍𝖺𝗋𝗍𝗌 𝗉𝗅𝖺𝗒𝗂𝗇𝗀 𝗍𝗁𝖾 𝗋𝖾𝗊𝗎𝖾𝗌𝗍𝖾𝖽 𝗍𝗋𝖺𝖼𝗄 𝗂𝗇𝗌𝗍𝖺𝗇𝗍𝗅𝗒.
𝟦. /𝗊𝗎𝖾𝗎𝖾 - 𝖲𝗁𝗈𝗐𝗌 𝗍𝗁𝖾 𝗅𝗂𝗌𝗍 𝗈𝖿 𝗊𝗎𝖾𝗎𝖾𝖽 𝗍𝗋𝖺𝖼𝗄𝗌.
𝟧. /𝗋𝖾𝗌𝗍𝖺𝗋𝗍 - 𝖱𝖾𝗌𝗍𝖺𝗋𝗍𝗌 𝗍𝗁𝖾 𝗆𝗎𝗌𝗂𝖼 𝖻𝗈𝗍.

**𝖠𝖽𝗆𝗂𝗇 𝖢𝗈𝗆𝗆𝖺𝗇𝖽𝗌:**
𝟣. /𝗌𝗄𝗂𝗉 - 𝖲𝗄𝗂𝗉𝗌 𝗍𝗁𝖾 𝗐𝗂𝗇𝖽𝗈𝗐𝗂𝗇𝗀 𝗍𝗋𝖺𝖼𝗄.
𝟤. /𝗉𝖺𝗎𝗌𝖾 - 𝖯𝖺𝗎𝗌𝖾𝗌 𝗍𝗁𝖾 𝗉𝗅𝖺𝗒𝗂𝗇𝗀 𝗆𝗎𝗌𝗂𝖼.
𝟥. /𝗋𝖾𝗌𝗎𝗆𝖾 - 𝖱𝖾𝗌𝗎𝗆𝖾𝗌 𝗍𝗁𝖾 𝗆𝗎𝗌𝗂𝖼.
𝟦. /𝖾𝗇𝖽 𝗈𝗋 /𝗌𝗍𝗈𝗉 - 𝖲𝗍𝗈𝗉𝗌 𝗍𝗁𝖾 𝗆𝗎𝗌𝗂𝖼 𝗌𝗍𝗋𝖾𝖺𝗆.
𝟧. /𝗋𝖾𝗅𝗈𝖺𝖽 - 𝖱𝖾𝗅𝗈𝖺𝖽𝗌 𝗍𝗁𝖾 𝖺𝖽𝗆𝗂𝗇 𝗅𝗂𝗌𝗍.

**𝖠𝗎𝗍𝗁 𝖴𝗌𝖾𝗋𝗌:**
𝖠𝗎𝗍𝗁 𝗎𝗌𝖾𝗋𝗌 𝖼𝖺𝗇 𝗎𝗌𝖾 𝖺𝖽𝗆𝗂𝗇 𝗋𝗂𝗀𝗁𝗍𝗌 𝗂𝗇 𝗍𝗁𝖾 𝖻𝗈𝗍 𝗐𝗂𝗍𝗁𝗈𝗎𝗍 𝗁𝖺𝗏𝗂𝗇𝗀 𝖺𝖽𝗆𝗂𝗇 𝗌𝗍𝖺𝗍𝗎𝗌 𝗂𝗇 𝗍𝗁𝖾 𝖼𝗁𝖺𝗍.

𝟣. /𝖺𝗎𝗍𝗁 <𝗎𝗌𝖾𝗋𝗇𝖺𝗆𝖾> - 𝖠𝖽𝖽𝗌 𝖺 𝗎𝗌𝖾𝗋 𝗍𝗈 𝗍𝗁𝖾 𝖺𝗎𝗍𝗁 𝗅𝗂𝗌𝗍.
𝟤. /𝗎𝗇𝖺𝗎𝗍𝗁 <𝗎𝗌𝖾𝗋𝗇𝖺𝗆𝖾> - 𝖱𝖾𝗆𝗈𝗏𝖾𝗌 𝖺 𝗎𝗌𝖾𝗋 𝖿𝗋𝗈𝗆 𝗍𝗁𝖾 𝖺𝗎𝗍𝗁 𝗅𝗂𝗌𝗍.
𝟥. /𝖺𝗎𝗍𝗁𝗎𝗌𝖾𝗋𝗌 - 𝖣𝗂𝗌𝗉𝗅𝖺𝗒𝗌 𝗍𝗁𝖾 𝗅𝗂𝗌𝗍 𝗈𝖿 𝗈𝗍𝗁𝗇𝖾𝗍𝗁𝗇𝗎𝗍𝗁𝗇𝗎𝗇𝗈𝗇𝗇𝗇𝗇𝖺𝗌𝗎𝗍𝖺𝗍𝖺.
"""
